In [1]:
import nivapy3 as nivapy
import pandas as pd

In [2]:
# Connect to db
ora_eng = nivapy.da.connect(src="nivabase")

Username:  ···
Password:  ········

Connection successful.

In [ ]:
# Group point inputs by regine
sql = (
    "SELECT a.regine, "
    "  a.type, "
    "  c.year, "
    "  b.name, "
    "  b.unit, "
    "  SUM(c.value * d.factor) as value "
    "FROM RESA2.RID_PUNKTKILDER a, "
    "RESA2.RID_PUNKTKILDER_OUTPAR_DEF b, "
    "RESA2.RID_PUNKTKILDER_INPAR_VALUES c, "
    "RESA2.RID_PUNKTKILDER_INP_OUTP d "
    "WHERE a.anlegg_nr = c.anlegg_nr "
    "AND d.in_pid = c.inp_par_id "
    "AND d.out_pid = b.out_pid "
    "GROUP BY a.regine, a.type, c.year, b.name, b.unit "
    "ORDER BY a.regine, a.type, c.year, b.name"
)
df = pd.read_sql(sql, ora_eng)

# Just data of interest
par_list = ["As", "Cd", "Cr", "Cu", "Hg", "Ni", "Pb", "Zn"]
df.dropna(subset=["regine"], inplace=True)
df = df.query("name in @par_list")

# Save
pt_csv = r"../data/metals/point_discharges/regine_pt_dis_metals.csv"
df.to_csv(pt_csv, index=False)

In [21]:
# All industry/renseanlegg inputs for Jose/annual TEOTIL report
sql = (
    "SELECT "
    "  a.anlegg_nr, "
    "  a.anlegg_navn as navn, "
    "  a.lon_utl as lon, "
    "  a.lat_utl as lat, "
    "  a.regine, "
    "  a.type, "
    "  c.year "
    "FROM RESA2.RID_PUNKTKILDER a, "
    "RESA2.RID_PUNKTKILDER_INPAR_VALUES c "
    "WHERE a.anlegg_nr = c.anlegg_nr "
    "GROUP BY a.anlegg_nr, a.anlegg_navn, a.lon_utl, a.lat_utl, a.regine, a.type, c.year "
    "ORDER BY a.anlegg_nr, a.anlegg_navn, a.lon_utl, a.lat_utl, a.regine, a.type, c.year"
)
df = pd.read_sql(sql, ora_eng)

# Save
pt_csv = r"nivabase_ind_ren_pt_discharges.csv"
df.to_csv(pt_csv, index=False)

df.head()

,anlegg_nr,navn,lon,lat,regine,type,year
0,0101.0022.01,Høvik Komponent A.S,11.424077,59.115619,001.22Z,INDUSTRI,1992
1,0101.0022.01,Høvik Komponent A.S,11.424077,59.115619,001.22Z,INDUSTRI,1993
2,0101.0022.01,Høvik Komponent A.S,11.424077,59.115619,001.22Z,INDUSTRI,1994
3,0101.0022.01,Høvik Komponent A.S,11.424077,59.115619,001.22Z,INDUSTRI,1995
4,0101.0022.01,Høvik Komponent A.S,11.424077,59.115619,001.22Z,INDUSTRI,1996

In [22]:
# All aquaculture inputs for Jose/annual TEOTIL report
sql = (
    "SELECT "
    "  a.nr as anlegg_nr, "
    "  a.navn, "
    "  a.bredde as lon, "
    "  a.lengde as lat, "
    "  a.regine, "
    "  b.ar "
    "FROM RESA2.rid_kilder_aquakultur a, "
    "RESA2.rid_kilder_aqkult_values b "
    "WHERE a.nr = b.anlegg_nr "
    "GROUP BY a.nr, a.navn, a.bredde, a.lengde, a.regine, b.ar "
    "ORDER BY a.nr, a.navn, a.bredde, a.lengde, a.regine, b.ar"
)
df = pd.read_sql(sql, ora_eng)

# Save
pt_csv = r"nivabase_aqu_pt_discharges.csv"
df.to_csv(pt_csv, index=False)